

import React, { useState } from 'react';
import equationScoreCalc from '../scoreCalc.JPG'

function Introduction() {

    //let isAfterDark = new Date().getHours() >= 13;
    let isAfterDark = false;
    return (
        <div style={{ direction: "rtl", margin: 50 }}>
            <h1>תחרות בוטים</h1>
            <p>
                התחרות תתקיים בקבוצות של 2-3 חברים בכל קבוצה.
                <br />
                <b>המטרה</b>: לתכנת את הבוט שינצח את כל הבוטים האחרים בסדרה של משחקים.
            </p>

            <h2>המשחק</h2>
            <p>
                מטרת הבוטים במשחק היא לכבוש כמה שיותר נקודות ציון ולשמור עליהן מפני הבוטים האחרים.
                <br />
                בכל משחק, כל קבוצה תקבל מספר אקראי אך שווה של ספינות (בין 4 ל 8) ויופיעו על המסך מספר אקראי של נקודות ציון (בין 4 ל 10).
                <br />
                נקודת ציון תהיה שייכת לקבוצה בעלת המספר הגבוה ביותר של ספינות באותה נקודת ציון (במקרה של שוויון, הקבוצה שהגיעה ראשונה - תמשיך להחזיק בנקודה).
                <br />
                כל משחק כולל <b>800</b> סבבים בהם יש אפשרות לספינות לנוע. בתום הסבבים, המשחק יגמר ותוצג התוצאה והמנצח.
                <br />
                בכל סבב, כל קבוצה תצבור נקודות כמספר נקודות הציון שהיא מחזיקה בסבב זה.
            </p>


            <h2>סבב הרצת משחקים</h2>
            <p>
                החל משעה 10:30 ועד 16:30, בכל חצי שעה תתבצע הרצת משחקים שבסופה יוצגו הבוטים לפי מיקומם ב Leaderboard.
                <br />
                בכל הרצה כזו, כל בוט יתמודד מול כל בוט אחר ב 5 משחקים שונים ("ראש בראש"). בנוסף, כל בוט יתמודד בכמות אקראית של משחקים נוספים מרובי משתתפים (4 קבוצות במשחק אחד), כך שישתתף לפחות ב 10 משחקים כאלה.
                <br />
                במשחק "ראש בראש" המנצח יזכה בנקודה והמפסיד ב 0. במשחק מרובה משתתפים המנצח יזכה ב 3 נקודות, המקום השני ב 2, המקום השלישי ב 1 והמקום הרביעי ב 0.
                <br />
                הניקוד המקסימלי שניתן לקבל בכל הרצה הוא 30+(numberOfGroups*5) וזה הניקוד לפיו הבוטים ישובצו ב Leaderboard.
                <br />
                בכל הרצה הניקוד יתאפס (על מנת לתת הזדמנות לשיפור הבוטים), כאשר ההרצה האחרונה (16:30) תקבע את המנצח הסופי.
                <br />
                <b>ניתן לראות הרצה גראפית של המשחקים בעמוד DisplayGame.</b>
            </p>

            <h2>חישוב ניקוד בכל סבב</h2>
            <p>
                <img src={equationScoreCalc} alt={"CalcEqu"} />
            </p>

            <h2>פיתוח</h2>
            <p>
                בטאב Controler תוכלו לקבל גרסה של הקונטרולר שמריץ את המשחק, זאת על מנת להריץ את הקוד אצלכם בעמדה, לדבאג ולוודא שהבוט שכתבתם רץ
                <br />
                כלים נדרשים לפיתוח:
                <br />
                NodeJS
                <br />
                Visual Studio Code
                <br />
            </p>

            <h2>נתונים טכניים למשחק</h2>
            <p>
                גודל רחבת המשחק הוא 200 יחידות אורך (ציר X) ו 100 יחידות גובה (ציר Y). כאשר בכל סבב בתוך המשחק, כל ספינה תזוז לכל היותר יחידה אחת בכל ציר.
                <br />
                רדיוס של נקודת ציון - 5 יחידות
                <br />
                הבוט (אותו הקבוצה מגישה) הוא פונקציית Javascript שמקבלת את הפרמטרים הבאים:
                <ul style={{ listStyleType: "circle" }}>
                    <li><b>ID</b> - מספר מזהה של השחקן במשחק</li>
                    <li><b>D</b> - מספר הספינות הכולל במשחק</li>
                    <li><b>Z</b> - מספר נקודות הציון במשחק</li>
                    <li><b>N</b> - מספר הקבוצות המשתתפות במשחק</li>
                    <li><b>R</b> - רדיוס כל נקודת ציון (כאשר הבוט נמצא ברדיוס, הוא נחשב ככובש נקודת הציון)</li>
                    <li><b>ZONES</b> - מערך של נקודות הציון.
                        <br />
                        אוביקט של נקודת ציון יכלול את הנתונים הבאים:
                        <ul>
                            <li><b>zoneID</b> - מזהה מספרי של נקודת הציון</li>
                            <li><b>owner</b> - מי מחזיק כרגע בנקודת הציון</li>
                            <li><b>x</b> - המיקום של נקודת הציון על ציר ה X</li>
                            <li><b>y</b> - המיקום של נקודת הציון על ציר ה Y</li>
                            {isAfterDark && <li style={{ color: 'red' }}><b>type - </b>שדה זה יופיע רק במידה ונקודת הציון היא מסוג תחנת דלק - והערך יהיה FUEL</li>}
                        </ul>
                    </li>
                    <li><b>DRONES</b> - מערך של הספינות הנמצאות במשחק.
                    <br />
                        אוביקט של ספינה יכלול את הנתונים הבאים:
                        <ul>
                            <li><b>droneID</b> - מזהה מספרי של הספינה</li>
                            <li><b>owner</b> - של איזו קבוצה הספינה</li>
                            <li><b>x</b> - המיקום של הספינה על ציר ה X</li>
                            <li><b>y</b> - המיקום של הספינה על ציר ה Y</li>
                            {isAfterDark && <li style={{ color: 'red' }}><b>fuel - </b>כמות הדלק שיש לספינה (ספינה מתחילה עם 660 יחידות דלק. בכל תור תרד יחידה אחת ואם הייתה תנועה בתור זה תרד יחידה נוספת)</li>}
                        </ul>
                    </li>
                    <li><b>EXTRA</b> - אוביקט שבו ניתן לשמור נתונים בין סבבים (האוביקט ניתן בתחילת משחק ריק)</li>
                </ul>
                <br />
                על הפונקציה להחזיר:
                <ul style={{ listStyleType: "circle" }}>
                    <li><b>drones</b> - רשימת ספינות ברשותך
                        <ul>
                            <li><b>droneid</b> - מזהה מספרי של הספינה</li>
                            <li><b>x</b> - המיקום של הספינה על ציר ה X</li>
                            <li><b>y</b> - המיקום של הספינה על ציר ה Y</li>
                        </ul>
                    </li>
                    <li><b>extra</b> - אוביקט שבו ניתן לשמור נתונים בין סבבים (האוביקט ניתן בתחילת משחק ריק)</li>
                </ul>
            </p>


            <h2>כללים</h2>
            <p>
                הקוד ייכתב ב-JavaScript vanilla בלבד!
                <br />
                אסור השימוש בספריות חיצוניות!
                <br />
                אל תתחילו לדחוף לולאות אינסופיות... חבל על הזמן שלכם ושלנו
                <br />
                זמן ריצה של תור לא יכול לעלות על 2s.
                <br />
            </p>


            <h2>דוגמה לבוט</h2>
            <p>
                <text style={{
                    whiteSpace: "pre",
                    direction: "ltr",
                    display: 'flex'
                }}>
                    {`
                        function runTurn(ID, D, Z, N, R, ZONES, DRONES, EXTRA) {
                            let resObj = {};
                            if (!EXTRA.alreadyinit) {
                                resObj.alreadyinit = true;
                            }
                            let myDrones = DRONES.filter(d => d.owner == ID)
                            myDrones.forEach((d, i) => d.toZone = (i % Z))
                            let locations = [];
                            myDrones.forEach(d => {
                                locations.push({ droneid: d.droneID, x: ZONES[d.toZone].x, y: ZONES[d.toZone].y })
                            })
                            return {drones: locations, extra: {}};
                            
                        }
                    
                            `}
                </text>
            </p>

        </div >
    );
}

export default Introduction;
